app/controllers/links_controller.rb

SELECT "links".* FROM "links" WHERE ("links"."id" = 1) LIMIT 1
---
  def show
    @link = Link.find(params[:id])

SELECT "links".* FROM "links" WHERE ("links"."id" = 3) LIMIT 1
---
  def edit
    @link = Link.find(params[:id])

INSERT INTO "links" ("created_at", "description", "destination", "page_id", "updated_at") VALUES ('2010-10-17 00:04:05.171875', 'Enter the kitchen', 3, NULL, '2010-10-17 00:04:05.171875')
---
  def create
    @link = Link.new(params[:link])

    respond_to do |format|
      if @link.save

SELECT "links".* FROM "links" WHERE ("links"."id" = 3) LIMIT 1
UPDATE "links" SET "description" = 'To walk into the kitchen', "updated_at" = '2010-10-18 00:55:59.171875' WHERE ("links"."id" = 3)
---
  def update
    @link = Link.find(params[:id])

    respond_to do |format|
      if @link.update_attributes(params[:link])

SELECT "links".* FROM "links" WHERE ("links"."id" = 6) LIMIT 1
DELETE FROM "links" WHERE ("links"."id" = 6)
---
  def destroy
    @link = Link.find(params[:id])
    @link.destroy