app/controllers/pages_controller.rb

  def show
    @page = Page.find(params[:id])
    @story = Story.find(@page.story_id)
    @links = Link.find(:all, :conditions => [ "page_id = :u", { :u => @page.id}])
---
SELECT "pages".* FROM "pages" WHERE ("pages"."id" = 1) LIMIT 1
SELECT "stories".* FROM "stories" WHERE ("stories"."id" = 1) LIMIT 1
SELECT "links".* FROM "links" WHERE (page_id = 2)

  def new
    @stories = Story.all
---
SELECT "stories".* FROM "stories"

  def edit
    @page = Page.find(params[:id])
    @stories = Story.all
---
SELECT "pages".* FROM "pages" WHERE ("pages"."id" = 1) LIMIT 1
SELECT "stories".* FROM "stories"

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("content", "created_at", "story_id", "updated_at") VALUES ('The kitchen has white tile floors, and white countertops. The knobs on the stove are melted from a cooking accident, and the railing separating the kitchen from the family room is shaky.

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT "pages".* FROM "pages" WHERE ("pages"."id" = 2) LIMIT 1
UPDATE "pages" SET "content" = 'The living room is great. There is a banjo and a guitar and a tv. There is a tattered love seat with a floral pattern hidden under a thin white blanket. A matching sofa sits next to it against the back wall. The fireplace is empty, the mantle sparsely decorated with assorted keepsakes.